[{"content":"Le JavaScript est un langage de programmation très populaire utilisé pour le développement web.","level":"easy","id":"29d48985-9e09-4c6f-a583-3cea6388adc6"},{"content":"React est une bibliothèque JavaScript très utilisée pour la construction d'interfaces utilisateur.","level":"medium","id":"53e3ea1c-d13f-47e8-a97c-3a20b73afe3f"},{"content":"Les arbres binaires sont des structures de données couramment utilisées en informatique.","level":"easy","id":"257e4a2e-8321-41f0-9fae-7a08335e7203"},{"content":"L'intelligence artificielle et l'apprentissage automatique sont des domaines en pleine expansion.","level":"medium","id":"3a629337-1264-465d-8935-b1066c97c19e"},{"content":"La programmation fonctionnelle est un paradigme de programmation qui met l'accent sur les fonctions pures.","level":"hard","id":"819f89c0-6113-4949-be11-a3a2a3c1c4b0"},{"content":"HTML est un langage de balisage utilisé pour créer des pages web.","level":"medium","id":"44fa1618-8b3a-44f5-8fd5-89de2634901d"},{"content":"Node.js est une plateforme de développement JavaScript côté serveur.","level":"easy","id":"e63c448c-86b8-465b-a1b6-b5f9602919a3"},{"content":"Le machine learning permet aux ordinateurs d'apprendre à partir de données et de prendre des décisions.","level":"hard","id":"4493989a-d4c4-44e8-bfe4-7b51394fa4fd"},{"content":"Les bases de données SQL sont utilisées pour stocker et gérer des données relationnelles.","level":"medium","id":"4f394c1e-7235-4705-8462-47274c1ac303"},{"content":"Python est un langage de programmation polyvalent utilisé dans divers domaines, y compris la science des données.","level":"easy","id":"47efc93e-3f59-4a76-bac7-aa7f9f514c7d"},{"content":"Les réseaux de neurones sont une technique clé en apprentissage profond.","level":"medium","id":"3aa6f124-c537-4788-8494-5d6be865dba3"},{"content":"JavaScript peut être utilisé à la fois côté client et côté serveur grâce à Node.js.","level":"easy","id":"996dd2a0-17d8-4e09-9e2a-92e1def45ecd"},{"content":"La sécurité informatique est essentielle pour protéger les données sensibles.","level":"hard","id":"ef81acf1-2b52-48df-afbf-ff52ec3bacaa"},{"content":"Les développeurs web utilisent souvent des frameworks comme Angular, React ou Vue.js.","level":"medium","id":"9ed1458a-04e1-4901-a3bf-d57c39f64056"},{"id":"aaeec293-daa3-457f-9af9-135e8519d0de","level":"easy","content":"Le HTML N'EST PAS un langage de programmation."}]